app/views/challenges/_accept.erb

SELECT "hookups".* FROM "hookups" WHERE "hookups"."user_id" = 1
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" IS NULL
---
<h3> Accepted challenges</h3>
<% Hookup.where(:user_id => current_user.id).each do |h| %>
	<% Challenge.where(:id => h.challenge_id).each do |c| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
		  You accepted
		  <%= User.where(:id => c.started_by).first.email %>'s