app/views/challenges/_current.html.erb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."started_by" = 1
---
<h3> Your challenges</h3>
<% Challenge.where(:started_by => current_user.id).each do |c| %>

SELECT "hookups".* FROM "hookups" WHERE "hookups"."challenge_id" = 6
---

	<% Hookup.where(:challenge_id => c.id).each do |h| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 1
---
		<$ else %>
			<% User.where(:id => h.user_id).each do |u| %>