app/views/challenges/_open.html.erb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."complete" = 'f'
---
<h3> Open challenges</h3>
<% Challenge.where(:complete => false).each do |c| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
</br>
  <%= User.where(:id => c.started_by).first.email %>