app/views/challenges/index.html.erb

	<%#= @challenges.each do |c| %>
	<% Challenge.editable_by(current_user).each do |c| %>
---
SELECT "challenges".* FROM "challenges"

		<td><%= c.wager %></td>
		<td><%= User.where(:id => c.started_by).first.email %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

		<td><%= link_to 'Accept Challenge', hookups_path(:challenge_id => c), :method => :post %></td>
		<td><%#= User.includes(:hookups).where(:challenge_id => c.id ).count %></td>
---
SELECT COUNT(DISTINCT "users"."id") FROM "users" LEFT OUTER JOIN "hookups" ON "hookups"."user_id" = "users"."id" WHERE "users"."challenge_id" = 6