app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
  def index
    @challenges = Challenge.all

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 1 LIMIT 1
---
  def show
    @challenge = Challenge.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 1 LIMIT 1
---
  def edit
    @challenge = Challenge.find(params[:id])

INSERT INTO "challenges" ("challenge_type", "updated_at", "challenger_email", "wager", "created_at", "started_by", "wager_qty", "challenge_name", "challenge_date", "due_date", "complete", "user_id", "challenger_name") VALUES (NULL, '2011-08-19 02:40:44.033638', NULL, 'one shake', '2011-08-19 02:40:44.033638', 3, NULL, 'make oauth work in win7', '2011-08-18', '2011-08-25', NULL, 3, NULL)
---
  def create
    @challenge = Challenge.new(params[:challenge])

	@challenge.challenge_date = Date.today
	@challenge.due_date = Date.today + 7
	@challenge.complete = false

	#for Devise
	if user_signed_in?
		@challenge.user_id = current_user.id
		@challenge.started_by = current_user.id

	end


    respond_to do |format|
      if @challenge.save

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 6 LIMIT 1
UPDATE "challenges" SET "updated_at" = '2011-08-20 20:30:45.989175', "completed_by" = 1, "complete" = 't' WHERE "challenges"."id" = 6
---
  def complete
    @challenge = Challenge.find(params[:id])

	if user_signed_in?
		@challenge.complete = true
		@challenge.completed_by = current_user.id
		@challenge.save

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 1 LIMIT 1
UPDATE "challenges" SET "challenge_type" = 'Game', "updated_at" = '2011-08-13 05:43:51.301116', "challenge_name" = 'Test' WHERE "challenges"."id" = 1
---
  def update
    @challenge = Challenge.find(params[:id])

    respond_to do |format|
      if @challenge.update_attributes(params[:challenge])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 3 LIMIT 1
DELETE FROM "challenges" WHERE "challenges"."id" = 3
---
  def destroy
    @challenge = Challenge.find(params[:id])
    @challenge.destroy