app/controllers/hookups_controller.rb

SELECT "hookups".* FROM "hookups"
---
  def index
    @hookups = Hookup.all

INSERT INTO "hookups" ("user_id", "updated_at", "created_at", "challenge_id") VALUES (1, '2011-08-18 05:03:28.566227', '2011-08-18 05:03:28.566227', NULL)
---
  def create

	# First, if the user is not signed in, kick them out
    if !user_signed_in?
		flash[:notice] = "You have to sign in first!"
		redirect_to new_user_registration_path


	else
		# Then, if they already accepted this challenge, kick them out
		if Hookup.where(:challenge_id => params[:challenge_id]).where(:user_id => current_user.id).present?
			flash[:notice] = "You already accepted!"
			redirect_to root_path


		# Only when the user is signed in and has not yet taken this challenge, make it
		else
			@hookup = current_user.hookups.build(:challenge_id => params[:challenge_id])
				if @hookup.save

SELECT "hookups".* FROM "hookups" WHERE "hookups"."id" = 1 LIMIT 1
DELETE FROM "hookups" WHERE "hookups"."id" = 1
---
  def destroy
    @hookup = Hookup.find(params[:id])
    @hookup.destroy